In [36]:
import pandas as pd

In [37]:
df = pd.read_csv('https://gist.githubusercontent.com/ahcamachod/807a2c1cf6c19108b2b701ea1791ab45/raw/fb84f8b2d8917a89de26679eccdbc8f9c1d2e933/alumnos.csv')
df

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   NaN      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   NaN      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   NaN      False
10    Danilo    21   NaN      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   NaN      False
15    Milena    29   7.0       True
16     Lucas    33   NaN      False
17     Nadia    34   8.0  Verdadero

### Limpieza de los Datos

#### Rellenar Notas

In [38]:
interpolar_datos = df.copy()    
interpolar_datos["Nota"] = df["Nota"].interpolate().round(1) # 
interpolar_datos

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   5.0      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   8.5      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   5.2      False
10    Danilo    21   4.9      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   8.0      False
15    Milena    29   7.0       True
16     Lucas    33   7.5      False
17     Nadia    34   8.0  Verdadero

#### Convertir de Verdadero a True

In [39]:
interpolar_datos["Aprobado"] = interpolar_datos["Aprobado"].replace({'Verdadero': True, 'False': False}).astype(bool) # Convertir a booleano
interpolar_datos

      Nombre  Edad  Nota  Aprobado
0    Alberto    20   7.5      True
1        Ana    18   5.0     False
2     Camila    27   2.5     False
3      David    18   5.0     False
4      Brian    21  10.0      True
5      Bruna    23   8.5     False
6    Daniela    21   7.0      True
7     Carlos    19   6.0     False
8     Alicia    35   5.6     False
9     Victor    28   5.2     False
10    Danilo    21   4.9     False
11   Ignacio    24   4.5     False
12  Stephany    26  10.0      True
13    Miriam    25   9.0      True
14     Pablo    37   8.0     False
15    Milena    29   7.0      True
16     Lucas    33   7.5     False
17     Nadia    34   8.0      True

1-Los estudiantes participaron en una actividad extracurricular y ganaron puntos extras. Estos puntos extras corresponden al 40% de su nota actual. Por lo tanto, crea una columna llamada "Puntos_extras" que contenga los puntos extras de cada estudiante, es decir, el 40% de su nota actual.

In [40]:
interpolar_datos["Puntos_extras"] = interpolar_datos["Nota"].apply(lambda x: x * 0.4) # Calcular puntos extras
interpolar_datos.head()

    Nombre  Edad  Nota  Aprobado  Puntos_extras
0  Alberto    20   7.5      True            3.0
1      Ana    18   5.0     False            2.0
2   Camila    27   2.5     False            1.0
3    David    18   5.0     False            2.0
4    Brian    21  10.0      True            4.0

 2-Crea otra columna llamada "Notas_finales" que contenga las notas de cada estudiante sumadas con los puntos extras.

In [41]:
interpolar_datos["Notas_finales"] = interpolar_datos["Nota"] + interpolar_datos["Puntos_extras"] # Sumar columnas
interpolar_datos.head()

    Nombre  Edad  Nota  Aprobado  Puntos_extras  Notas_finales
0  Alberto    20   7.5      True            3.0           10.5
1      Ana    18   5.0     False            2.0            7.0
2   Camila    27   2.5     False            1.0            3.5
3    David    18   5.0     False            2.0            7.0
4    Brian    21  10.0      True            4.0           14.0

3-Dado que hubo una puntuación extra, algunos estudiantes que no habían sido aprobados antes pueden haber sido aprobados ahora. En función de esto, crea una columna llamada "Aprobado_final" con los siguientes valores:
        True: si el estudiante está aprobado (la nota final debe ser mayor o igual a 7.0).
        False: si el estudiante está reprobado (la nota final debe ser menor que 7.0).

In [42]:
interpolar_datos["Aprobado_final"] = interpolar_datos["Notas_finales"].apply(lambda x: True if x >= 7 else False) # Determinar si aprobo
interpolar_datos.head()

    Nombre  Edad  Nota  Aprobado  Puntos_extras  Notas_finales  Aprobado_final
0  Alberto    20   7.5      True            3.0           10.5            True
1      Ana    18   5.0     False            2.0            7.0            True
2   Camila    27   2.5     False            1.0            3.5           False
3    David    18   5.0     False            2.0            7.0            True
4    Brian    21  10.0      True            4.0           14.0            True

4- Realiza una selección y verifica qué estudiantes no habían sido aprobados anteriormente, pero ahora fueron aprobados después de sumar los puntos extras.

In [43]:
seleccion = (interpolar_datos["Aprobado"] == False) & (interpolar_datos["Aprobado_final"] == True)
interpolar_datos[seleccion]

    Nombre  Edad  Nota  Aprobado  Puntos_extras  Notas_finales  Aprobado_final
1      Ana    18   5.0     False           2.00           7.00            True
3    David    18   5.0     False           2.00           7.00            True
5    Bruna    23   8.5     False           3.40          11.90            True
7   Carlos    19   6.0     False           2.40           8.40            True
8   Alicia    35   5.6     False           2.24           7.84            True
9   Victor    28   5.2     False           2.08           7.28            True
14   Pablo    37   8.0     False           3.20          11.20            True
16   Lucas    33   7.5     False           3.00          10.50            True